In [1]:
import pandas as pd
import numpy as np
import os
import sweetviz as sv
working_dir = os.getcwd()
file_dir = os.path.join(working_dir , "Data")
train_file = os.path.join(file_dir , "train.csv")
test_file = os.path.join(file_dir , "test.csv")

In [2]:
train = pd.read_csv(train_file)
train.head()
result = sv.analyze([train, "Train"],target_feat='Survived')
result.show_html('Report.html')

:FEATURES DONE:                    |█████████████████████| [100%]   00:04  -> (00:00 left)
:PAIRWISE DONE:                    |█████████████████████| [100%]   00:00  -> (00:00 left)
Creating Associations graph...DONE!
Report Report.html was generated! NOTEBOOK/COLAB USERS: no browser will pop up, the report is saved in your notebook/colab files.

In [3]:
test = pd.read_csv(test_file)
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
print(train.isnull().sum())
print('percentage of missing values')
print(train.isnull().sum() / len(train) * 100)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
percentage of missing values
PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [5]:
col = ['Cabin']
train = train.drop(col , axis = 1)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [6]:
#removing Ticket cause not related
col = ["Ticket"]
train = train.drop(col , axis= 1)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [7]:
# converting categorical values to numeric ones

dummies = []

cols = ["Sex", "Embarked","Pclass"]
for col in cols:
    dummies.append(pd.get_dummies(train[col]))
dummy_df = pd.concat(dummies , axis= 1)
dummy_df.head()

   female  male  C  Q  S  1  2  3
0       0     1  0  0  1  0  0  1
1       1     0  1  0  0  1  0  0
2       1     0  0  0  1  0  0  1
3       1     0  0  0  1  1  0  0
4       0     1  0  0  1  0  0  1

In [8]:
train = pd.concat((train , dummy_df) , axis=1)
train = train.drop(cols , axis=1)
train.head()

,PassengerId,Survived,Name,Age,SibSp,Parch,Fare,female,male,C,Q,S,1,2,3
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,7.2500,0,1,0,0,1,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,71.2833,1,0,1,0,0,1,0,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,7.9250,1,0,0,0,1,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,53.1000,1,0,0,0,1,1,0,0
4,5,0,"Allen, Mr. William Henry",35.0,0,0,8.0500,0,1,0,0,1,0,0,1

In [9]:
train.isna().sum()

PassengerId      0
Survived         0
Name             0
Age            177
SibSp            0
Parch            0
Fare             0
female           0
male             0
C                0
Q                0
S                0
1                0
2                0
3                0
dtype: int64

In [10]:
train["Age"] = train["Age"].interpolate()

In [11]:
# creating family size
train['Family_size'] = train['SibSp'] + train["Parch"] + 1

In [12]:

# train['Title'] = train['Name'].str.split(", " , expand = True)[1].str.split(".",expand = True)[0]
train['FarePerPerson'] = train["Fare"] / train["Family_size"]
train.drop(["Name"] , axis = 1 , inplace = True)
train.head()

,PassengerId,Survived,Age,SibSp,Parch,Fare,female,male,C,Q,S,1,2,3,Family_size,FarePerPerson
0,1,0,22.0,1,0,7.2500,0,1,0,0,1,0,0,1,2,3.62500
1,2,1,38.0,1,0,71.2833,1,0,1,0,0,1,0,0,2,35.64165
2,3,1,26.0,0,0,7.9250,1,0,0,0,1,0,0,1,1,7.92500
3,4,1,35.0,1,0,53.1000,1,0,0,0,1,1,0,0,2,26.55000
4,5,0,35.0,0,0,8.0500,0,1,0,0,1,0,0,1,1,8.05000

In [13]:
# train["Title"].value_counts()
# from sklearn.preprocessing import LabelEncoder
# label = LabelEncoder()

# train['Title'] = label.fit_transform(list(train['Title'].values))
train.head()

,PassengerId,Survived,Age,SibSp,Parch,Fare,female,male,C,Q,S,1,2,3,Family_size,FarePerPerson
0,1,0,22.0,1,0,7.2500,0,1,0,0,1,0,0,1,2,3.62500
1,2,1,38.0,1,0,71.2833,1,0,1,0,0,1,0,0,2,35.64165
2,3,1,26.0,0,0,7.9250,1,0,0,0,1,0,0,1,1,7.92500
3,4,1,35.0,1,0,53.1000,1,0,0,0,1,1,0,0,2,26.55000
4,5,0,35.0,0,0,8.0500,0,1,0,0,1,0,0,1,1,8.05000

In [14]:
train.describe()

,PassengerId,Survived,Age,SibSp,Parch,Fare,female,male,C,Q,S,1,2,3,Family_size,FarePerPerson
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,29.726061,0.523008,0.381594,32.204208,0.352413,0.647587,0.188552,0.086420,0.722783,0.242424,0.206510,0.551066,1.904602,19.916375
std,257.353842,0.486592,13.902353,1.102743,0.806057,49.693429,0.477990,0.477990,0.391372,0.281141,0.447876,0.428790,0.405028,0.497665,1.613459,35.841257
min,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000
25%,223.500000,0.000000,21.000000,0.000000,0.000000,7.910400,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,7.250000
50%,446.000000,0.000000,28.500000,0.000000,0.000000,14.454200,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,0.000000,1.000000,1.000000,8.300000
75%,668.500000,1.000000,38.000000,1.000000,0.000000,31.000000,1.000000,1.000000,0.000000,0.000000,1.000000,0.000000,0.000000,1.000000,2.000000,23.666667
max,891.000000,1.000000,80.000000,8.000000,6.000000,512.329200,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,11.000000,512.329200

In [15]:
y = train['Survived']
X = train.drop(['Survived' , "PassengerId" , "Fare"] , axis=1)
X.head()

,Age,SibSp,Parch,female,male,C,Q,S,1,2,3,Family_size,FarePerPerson
0,22.0,1,0,0,1,0,0,1,0,0,1,2,3.62500
1,38.0,1,0,1,0,1,0,0,1,0,0,2,35.64165
2,26.0,0,0,1,0,0,0,1,0,0,1,1,7.92500
3,35.0,1,0,1,0,0,0,1,1,0,0,2,26.55000
4,35.0,0,0,0,1,0,0,1,0,0,1,1,8.05000

In [16]:
from sklearn.model_selection import train_test_split

X_train , X_test , y_train , y_test = train_test_split(X,y,test_size = 0.3,random_state = 0)

In [17]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import cross_val_score
from sklearn.metrics import accuracy_score

model = DecisionTreeClassifier(max_depth = 6)
model.fit(X_train , y_train)
cv = cross_val_score(model , X_train , y_train , cv = 7)
print(cv)
y_pred = model.predict(X_test)
accuracy_score(y_test,y_pred)

[0.74157303 0.78651685 0.84269663 0.74157303 0.76404494 0.82022472
 0.76404494]

0.8022388059701493

In [18]:
from sklearn import ensemble
classifier = ensemble.RandomForestClassifier(n_estimators=130)
classifier.fit(X_train , y_train)
classifier.score(X_test , y_test)

0.7947761194029851

In [19]:
classifier = ensemble.GradientBoostingClassifier(n_estimators=50)
classifier.fit(X_train , y_train)
classifier.score(X_test, y_test)

0.8283582089552238

In [20]:
# pre_processing test data
cols = ["Ticket" , "Cabin"]
test = test.drop(cols , axis=1)
dummies = []
cols = ["Sex" , "Embarked" , "Pclass"]
for column in cols:
    dummies.append(pd.get_dummies(test[column]))
dummy_df = pd.concat(dummies,axis=1)
test = pd.concat((test , dummy_df) , axis=1)
test = test.drop(cols , axis = 1)
test.head()

,PassengerId,Name,Age,SibSp,Parch,Fare,female,male,C,Q,S,1,2,3
0,892,"Kelly, Mr. James",34.5,0,0,7.8292,0,1,0,1,0,0,0,1
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,7.0000,1,0,0,0,1,0,0,1
2,894,"Myles, Mr. Thomas Francis",62.0,0,0,9.6875,0,1,0,1,0,0,1,0
3,895,"Wirz, Mr. Albert",27.0,0,0,8.6625,0,1,0,0,1,0,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,12.2875,1,0,0,0,1,0,0,1

In [21]:
test['Age'] = test['Age'].interpolate()
test['Fare'] = test['Fare'].fillna(test['Fare'].mean())
test.head()

,PassengerId,Name,Age,SibSp,Parch,Fare,female,male,C,Q,S,1,2,3
0,892,"Kelly, Mr. James",34.5,0,0,7.8292,0,1,0,1,0,0,0,1
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,7.0000,1,0,0,0,1,0,0,1
2,894,"Myles, Mr. Thomas Francis",62.0,0,0,9.6875,0,1,0,1,0,0,1,0
3,895,"Wirz, Mr. Albert",27.0,0,0,8.6625,0,1,0,0,1,0,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,12.2875,1,0,0,0,1,0,0,1

In [22]:
test["Family_size"] = test["SibSp"] + test["Parch"] + 1
# test["Title"] = test["Name"].str.split(", ",expand =  True)[1].str.split(".",expand = True)[0]
test["FarePerPerson"] = test["Fare"] / test["Family_size"]
test.head()

,PassengerId,Name,Age,SibSp,Parch,Fare,female,male,C,Q,S,1,2,3,Family_size,FarePerPerson
0,892,"Kelly, Mr. James",34.5,0,0,7.8292,0,1,0,1,0,0,0,1,1,7.829200
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,7.0000,1,0,0,0,1,0,0,1,2,3.500000
2,894,"Myles, Mr. Thomas Francis",62.0,0,0,9.6875,0,1,0,1,0,0,1,0,1,9.687500
3,895,"Wirz, Mr. Albert",27.0,0,0,8.6625,0,1,0,0,1,0,0,1,1,8.662500
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,12.2875,1,0,0,0,1,0,0,1,3,4.095833

In [23]:
cols = ["Name" , "Fare"]
test.drop(cols , axis=1 ,inplace=True)
# test['Title'] = label.fit_transform(list(test['Title'].values))
test.head()

,PassengerId,Age,SibSp,Parch,female,male,C,Q,S,1,2,3,Family_size,FarePerPerson
0,892,34.5,0,0,0,1,0,1,0,0,0,1,1,7.829200
1,893,47.0,1,0,1,0,0,0,1,0,0,1,2,3.500000
2,894,62.0,0,0,0,1,0,1,0,0,1,0,1,9.687500
3,895,27.0,0,0,0,1,0,0,1,0,0,1,1,8.662500
4,896,22.0,1,1,1,0,0,0,1,0,0,1,3,4.095833

In [24]:
X_res = test.drop(["PassengerId"] , axis = 1)
X_res.head()

,Age,SibSp,Parch,female,male,C,Q,S,1,2,3,Family_size,FarePerPerson
0,34.5,0,0,0,1,0,1,0,0,0,1,1,7.829200
1,47.0,1,0,1,0,0,0,1,0,0,1,2,3.500000
2,62.0,0,0,0,1,0,1,0,0,1,0,1,9.687500
3,27.0,0,0,0,1,0,0,1,0,0,1,1,8.662500
4,22.0,1,1,1,0,0,0,1,0,0,1,3,4.095833

In [25]:
y_pred = classifier.predict(X_res)

In [26]:
output_df = pd.DataFrame(test["PassengerId"])
output_df["Survived"] = y_pred
output_df.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

In [36]:
# output_df.to_csv('results.csv' , index = False)
parameter_list = [15.0, 2, 2, 1, 0, 1, 0, 0, 1, 0, 0, 5, 2.0]

array = np.array([parameter_list])
prediction = classifier.predict(array)
print(prediction)

[1]

In [37]:
from joblib import dump , load
dump(classifier  , "titanic.joblib")

['titanic.joblib']